#ifndef COMBO_COMMON_ACTOR_H
#define COMBO_COMMON_ACTOR_H

#if !defined(__ASSEMBLER__)
# include <combo/types.h>
# include <combo/util.h>
#endif

#if defined(GAME_OOT)
# define AC_PLAYER                  0x000
# define AC_EN_TEST                 0x002
# define AC_ITEM_GIVER              0x003
# define AC_EN_GIRLA                0x004
# define AC_CUSTOM_WARP             0x005
# define AC_CUSTOM_TRIGGERS         0x006
# define AC_EN_PART                 0x007
# define AC_EN_LIGHT                0x008
# define AC_EN_DOOR                 0x009
# define AC_EN_BOX                  0x00a
# define AC_BG_DY_YOSEIZO           0x00b
# define AC_BG_HIDAN_FIREWALL       0x00c
# define AC_EN_POH                  0x00d
# define AC_EN_OKUTA                0x00e
# define AC_BG_YDAN_SP              0x00f
# define AC_EN_BOM                  0x010
# define AC_EN_WALLMAS              0x011
# define AC_EN_DODONGO              0x012
# define AC_EN_FIREFLY              0x013
# define AC_EN_HORSE                0x014
# define AC_EN_ITEM00               0x015
# define AC_EN_ARROW                0x016
# define AC_CUSTOM_TORCH2           0x017
# define AC_EN_ELF                  0x018
# define AC_EN_NIW                  0x019
# define AC_EN_TITE                 0x01b
# define AC_EN_REEBA                0x01c
# define AC_EN_PEEHAT               0x01d
# define AC_EN_BUTTE                0x01e
# define AC_EN_INSECT               0x020
# define AC_EN_FISH                 0x021

# define AC_EN_TANRON5          0x268
# define AC_EN_TANRON6          0x269
# define AC_EN_DAIKU2           0x26a
# define AC_EN_MUTO             0x26b
# define AC_EN_BAISEN           0x26c
# define AC_EN_HEISHI           0x26d
# define AC_EN_DEMO_HEISHI      0x26e
# define AC_EN_DT               0x26f
# define AC_EN_CHA              0x270
# define AC_OBJ_DINNER          0x271
# define AC_EFF_LASTDAY         0x272
# define AC_BG_IKANA_DHARMA     0x273
# define AC_EN_AKINDONUTS       0x274
# define AC_EFF_STK             0x275
# define AC_EN_IG               0x276
# define AC_EN_RG               0x277
# define AC_EN_OSK              0x278
# define AC_EN_STH2             0x279
# define AC_EN_YB               0x27a
# define AC_EN_RZ               0x27b
# define AC_EN_SCOPECOIN        0x27c
# define AC_EN_BJT              0x27d
# define AC_EN_BOMJIMA          0x27e
# define AC_EN_BOMJIMB          0x27f
# define AC_EN_BOMBERS          0x280
# define AC_EN_BOMBERS2         0x281
# define AC_EN_BOMBAL           0x282
# define AC_OBJ_MOON_STONE      0x283
# define AC_OBJ_MU_PICT         0x284
# define AC_BG_IKNINSIDE        0x285
# define AC_EFF_ZORABAND        0x286
# define AC_OBJ_KEPN_KOYA       0x287
# define AC_OBJ_USIYANE         0x288
# define AC_EN_NNH              0x289
# define AC_OBJ_KZSAKU          0x28a
# define AC_OBJ_MILK_BIN        0x28b
# define AC_EN_KITAN            0x28c
# define AC_BG_ASTR_BOMBWALL    0x28d
# define AC_BG_IKNIN_SUSCEIL    0x28e
# define AC_EN_BSB              0x28f
# define AC_EN_RECEPGIRL        0x290
# define AC_EN_THIEFBIRD        0x291
# define AC_EN_JGAME_TSN        0x292
# define AC_OBJ_JGAME_LIGHT     0x293
# define AC_OBJ_YADO            0x294
# define AC_DEMO_SYOTEN         0x295
# define AC_DEMO_MOONEND        0x296
# define AC_BG_LBFSHOT          0x297
# define AC_BG_LAST_BWALL       0x298
# define AC_EN_AND              0x299
# define AC_EN_INVADEPOH_DEMO   0x29a
# define AC_OBJ_DANPEILIFT      0x29b
# define AC_EN_FALL2            0x29c
# define AC_DM_AL               0x29d
# define AC_DM_AN               0x29e
# define AC_DM_AH               0x29f
# define AC_DM_NB               0x2a0
# define AC_EN_DRS              0x2a1
# define AC_EN_ENDING_HERO      0x2a2
# define AC_DM_BAL              0x2a3
# define AC_EN_PAPER            0x2a4
# define AC_EN_HINT_SKB         0x2a5
# define AC_DM_TAG              0x2a6
# define AC_EN_BH               0x2a7
# define AC_EN_ENDING_HERO2     0x2a8
# define AC_EN_ENDING_HERO3     0x2a9
# define AC_EN_ENDING_HERO4     0x2aa
# define AC_EN_ENDING_HERO5     0x2ab
# define AC_EN_ENDING_HERO6     0x2ac
# define AC_DM_GM               0x2ad
# define AC_OBJ_SWPRIZE         0x2ae
# define AC_EN_INVISIBLE_RUPPE  0x2af
# define AC_OBJ_ENDING          0x2b0
# define AC_EN_RSN              0x2b1

#endif

#if !defined(__ASSEMBLER__)
typedef struct GameState_Play GameState_Play;
typedef struct ActorContext ActorContext;
typedef struct Actor Actor;

typedef void (*ActorCallback)(Actor*, GameState_Play*);

typedef struct
{
    Vec3f pos;
    Vec3s rot;
}
PosRot;

typedef struct Actor
{
    u16         id;
    u8          type;
    u8          room;
    s32         flags;
    PosRot      home;
    u16         variable;
    s8          objTableIndex;
    s8          targetMode;

#if defined(GAME_OOT)
    u16        sfx;
    PosRot     world;
    PosRot     focus;
#endif

#if defined(GAME_MM)
    s16        halfDaysBits;
    PosRot     world;
    s8         csId;
    u8         audioFlags;
    PosRot     focus;
    u16        sfx;
#endif

    float       targetArrowOffset;
    Vec3f       scale;
    Vec3f       velocity;
    float       speedXZ;
    float       gravity;
    float       minVelocityY;
    CollisionPoly* wallPoly; // Wall polygon the actor is touching
    CollisionPoly* floorPoly; // Floor polygon directly below the actor
    u8          wallBgId; // Bg ID of the wall polygon the actor is touching
    u8          floorBgId; // Bg ID of the floor polygon directly below the actor
    s16         wallYaw; // Y rotation of the wall polygon the actor is touching
    f32         floorHeight; // Y position of the floor polygon directly below the actor
    f32         yDistToWater; // Distance to the surface of active waterbox. Negative value means above water
    u16         bgCheckFlags; // Flags indicating how the actor is interacting with collision
    s16         yawTowardsPlayer; // Y rotation difference between the actor and the player
    f32         xyzDistToPlayerSq; // Squared distance between the actor and the player
    f32         xzDistanceFromLink;
    f32         yDistanceFromLink;
    CollisionCheckInfo colChkInfo;
    Vec3s       rot2;
    char        unk_ba[2];
    float       modelOffsetY;
    char        unk_c0[0x4e];
    u16         messageId;
    u16         freezeTimer;
    char        unk_11A[0x6];
    Actor*      parent;
    Actor*      child;
    Actor*      prev;
    Actor*      next;
    void*       init;
    void*       fini;
    void*       update;
    void*       draw;
    void*       ovl;
}
Actor;

#if defined(GAME_MM)
typedef struct
{
    u32     count;
    Actor*  first;
    char    unk_8[0x4];
}
ActorList;
#endif

#if defined(GAME_OOT)
# define X(x) (x)
#else
# define X(x) (x + 8)
#endif

ASSERT_OFFSET(Actor, id,        0x000);
ASSERT_OFFSET(Actor, type,      0x002);
ASSERT_OFFSET(Actor, room,      0x003);
ASSERT_OFFSET(Actor, home,      0x008);
ASSERT_OFFSET(Actor, variable,  0x01c);
ASSERT_OFFSET(Actor, parent, X(0x118));
ASSERT_OFFSET(Actor, child, X(0x11c));
ASSERT_OFFSET(Actor, prev,      X(0x120));
ASSERT_OFFSET(Actor, next,      X(0x124));
ASSERT_OFFSET(Actor, init,      X(0x128));
ASSERT_OFFSET(Actor, fini,      X(0x12c));
ASSERT_OFFSET(Actor, update,    X(0x130));
ASSERT_OFFSET(Actor, draw,      X(0x134));
ASSERT_OFFSET(Actor, ovl,       X(0x138));

#undef X


#if defined(GAME_OOT)
_Static_assert(sizeof(Actor) == 0x13c, "OoT Actor size is wrong");
#endif

#if defined(GAME_MM)
_Static_assert(sizeof(Actor) == 0x144, "MM Actor size is wrong");
_Static_assert(sizeof(ActorList) == 0xC, "MM ActorList size is wrong");
#endif

typedef struct BlinkInfo {
    /* 0x0 */ s16 eyeTexIndex;
    /* 0x2 */ s16 blinkTimer;
} BlinkInfo; // size = 0x4

Actor* comboSpawnActor(ActorContext* actorCtx, GameState_Play *play, short actorId, float x, float y, float z, s16 rx, s16 ry, s16 rz, u16 variable);
Actor* comboSpawnActorEx(ActorContext* actorCtx, GameState_Play *play, short actorId, float x, float y, float z, s16 rx, s16 ry, s16 rz, u16 variable, int ex1, int ex2, int ex3);

typedef enum {
    /* 0x00 */ ACTORCAT_SWITCH,
    /* 0x01 */ ACTORCAT_BG,
    /* 0x02 */ ACTORCAT_PLAYER,
    /* 0x03 */ ACTORCAT_EXPLOSIVE,
    /* 0x04 */ ACTORCAT_NPC,
    /* 0x05 */ ACTORCAT_ENEMY,
    /* 0x06 */ ACTORCAT_PROP,
    /* 0x07 */ ACTORCAT_ITEMACTION,
    /* 0x08 */ ACTORCAT_MISC,
    /* 0x09 */ ACTORCAT_BOSS,
    /* 0x0A */ ACTORCAT_DOOR,
    /* 0x0B */ ACTORCAT_CHEST,
    /* 0x0C */ ACTORCAT_MAX
} ActorCategory;

#endif

#endif
